Revit 2026 API

# WaterLoopData Class

---

Represents the data and parameters of analytical water loop.

SystemObject Autodesk.Revit.DB.MechanicalWaterLoopData

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WaterLoopData : IDisposable
```
```vb
Public Class WaterLoopData
	Implements IDisposable
```
```cpp
public ref class WaterLoopData : IDisposable
```
```fsharp
type WaterLoopData =
    class
        interface IDisposable
    end
```

The WaterLoopData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ChillerType | The type of water chiller. Note this property change would reset the condenser water loop. |
|  | CondenserWaterLoopId | The water loop element id for the water cooled chiller. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | WaterLoopType | The type of water loop. Note this property change would reset other properties. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the WaterLoopData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace